### Forest: snapshot-service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
data.external.sources_tar: Reading...
data.local_file.init: Reading...
data.local_file.init: Read complete after 0s [id=77298e3fbe90b09f523af110328b6459bffa71c6]
module.monitoring[0].newrelic_alert_policy.alert: Refreshing state... [id=1322546]
module.monitoring[0].newrelic_notification_channel.slack-channel[0]: Refreshing state... [id=e7377463-55c5-4646-8efb-ffaa07c3abb5]
data.external.sources_tar: Read complete after 0s [id=-]
data.local_file.sources: Reading...
data.digitalocean_project.forest_project: Reading...
data.digitalocean_ssh_keys.keys: Reading...
data.local_file.sources: Read complete after 0s [id=3c241b935b31509a66a77870f804ed3c0161382b]
data.digitalocean_ssh_keys.keys: Read complete after 1s [id=ssh_keys/8656000852680004208]
digitalocean_droplet.forest: Refreshing state... [id=407706811]
digitalocean_firewall.forest-firewall: Refreshing state... [id=964331e1-2a3d-427b-96e8-6a353cfe7c83]
data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.monitoring[0].newrelic_workflow.alerting-workflow-slack[0]: Refreshing state... [id=9ca27a72-53b2-4b75-a426-9770bd7bdf17]
module.monitoring[0].newrelic_nrql_alert_condition.disk_space: Refreshing state... [id=1322546:6021305]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # digitalocean_droplet.forest must be replaced
-/+ resource "digitalocean_droplet" "forest" {
      ~ created_at           = "2024-03-18T20:15:14Z" -> (known after apply)
      ~ disk                 = 200 -> (known after apply)
      ~ id                   = "407706811" -> (known after apply)
      ~ ipv4_address         = "206.189.51.247" -> (known after apply)
      ~ ipv4_address_private = "10.135.0.3" -> (known after apply)
      + ipv6_address         = (known after apply)
      ~ locked               = false -> (known after apply)
      ~ memory               = 16384 -> (known after apply)
        name                 = "prod-forest-snapshot"
      ~ price_hourly         = 0.125 -> (known after apply)
      ~ price_monthly        = 84 -> (known after apply)
      ~ private_networking   = true -> (known after apply)
      ~ status               = "active" -> (known after apply)
        tags                 = [
            "iac",
            "prod",
        ]
      ~ urn                  = "do:droplet:407706811" -> (known after apply)
      ~ user_data            = (sensitive value) # forces replacement
      ~ vcpus                = 4 -> (known after apply)
      ~ volume_ids           = [] -> (known after apply)
      ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # digitalocean_firewall.forest-firewall will be updated in-place
  ~ resource "digitalocean_firewall" "forest-firewall" {
      ~ droplet_ids     = [
          - 407706811,
        ] -> (known after apply)
        id              = "964331e1-2a3d-427b-96e8-6a353cfe7c83"
        name            = "prod-forest-snapshot"
        tags            = []
        # (3 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # digitalocean_project_resources.connect_forest_project will be updated in-place
  ~ resource "digitalocean_project_resources" "connect_forest_project" {
        id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
      ~ resources = [
          - "do:droplet:407706811",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

Changes to Outputs:
  ~ ip = [
      - "206.189.51.247",
      + (known after apply),
    ]

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/forest-iac/forest-iac/tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/forest-iac/forest-iac/tfplan"
```

</details>